Revit 2026 API

# DuctSizeSettingIterator Properties

---

The DuctSizeSettingIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DuctSizeSettingIterator Class

Autodesk.Revit.DB.Mechanical Namespace